---
kind: type
id: T:Autodesk.Revit.DB.Structure.StructuralWallUsage
source: html/27172688-7a15-3991-240c-13705909ba51.htm
---
# Autodesk.Revit.DB.Structure.StructuralWallUsage

Represents the structural usage of a wall.

## Syntax (C#)
```csharp
public enum StructuralWallUsage
```